fermarsan/aixt/ports/Microchip/PIC16F8x/examples/PORT.X/port.c
// This C code was automatically generated by Aixt Project
// Device = PIC16F84A
// Board = Nothing
// Backend = c

#include <xc.h>
#include <stdio.h>
#define _XTAL_FREQ 4000000
#define true   1
#define false  0
#pragma config FOSC = HS        // Oscillator Selection bits (HS oscillator)
#pragma config WDTE = OFF       // Watchdog Timer (WDT disabled)
#pragma config PWRTE = OFF      // Power-up Timer Enable bit (Power-up Timer is disabled)
#pragma config CP = OFF         // Code Protection bit (Code protection disabled)
#define TRISa		TRISA	// port setup name equivalents
#define TRISb		TRISB
#define PORTa		PORTA	// port in name equivalents
#define PORTb		PORTB
#define a0_s    TRISAbits.TRISA0    // pin configuration pits
#define a1_s    TRISAbits.TRISA1
#define a2_s    TRISAbits.TRISA2
#define a3_s    TRISAbits.TRISA3
#define b0_s    TRISBbits.TRISB0
#define b1_s    TRISBbits.TRISB1
#define b2_s    TRISBbits.TRISB2
#define b3_s    TRISBbits.TRISB3
#define b4_s    TRISBbits.TRISB4
#define b5_s    TRISBbits.TRISB5
#define b6_s    TRISBbits.TRISB6
#define b7_s    TRISBbits.TRISB7
#define a0    PORTAbits.RA0       // pin input and output pits
#define a1    PORTAbits.RA1
#define a2    PORTAbits.RA2
#define a3    PORTAbits.RA3
#define b0    PORTBbits.RB0
#define b1    PORTBbits.RB1
#define b2    PORTBbits.RB2
#define b3    PORTBbits.RB3
#define b4    PORTBbits.RB4
#define b5    PORTBbits.RB5
#define b6    PORTBbits.RB6
#define b7    PORTBbits.RB7
#define port__read(PORT_NAME)  PORT ## PORT_NAME
#define port__setup(PORT_NAME, VALUE)   TRIS ## PORT_NAME = VALUE
#define port__write(PORT_NAME, VALUE)  PORT ## PORT_NAME = VALUE
#define time__sleep_ms(TIME)    __delay_ms(TIME)  // implementing by a macro for saving memory

void main__init();

void port__init();

void time__init();

void main__init() {
	port__init();
	time__init();
	
}

void port__init() {
}

void time__init() {
}

void main(void) {
	main__init();
	port__setup(b, 0b00000000);
	while(true) {
		port__write(b, 0b01010101);
		time__sleep_ms(500);
		port__write(b, 0b10101010);
		time__sleep_ms(500);
	}
}
